Repository: common-repository/wp-campaigns
Catalog: languages/wp-campaigns-*.po
Languages: he_il

source: Add New campaign
he_il: צור קמפיין חדש

source: New campaign
he_il: קמפיין חדש

source: Edit campaign
he_il: ערוך קמפיין

source: View campaign
he_il: הצג קמפיין

source: All campaigns
he_il: כל הקמפיינים

source: Search campaigns
he_il: חיפוש בקמפיינים

source: Parent campaigns:
he_il: קמפיינים אב:

source: No campaigns found.
he_il: לא נמצאו קמפיינים.

source: No campaigns found in Trash.
he_il: לא נמצאו קמפיינים באשפה.

source: Search Campaign's statuses
he_il: חפש סטטוסים של קמפיין

source: All Campaign's statuses
he_il: כל הסטטוסים של הקמפיין

source: Parent Campaign's status
he_il: סטטוס אב של הקמפיינים

source: Parent Campaign's status:
he_il: סטטוס אב של הקמפיינים:

source: Edit Campaign's status
he_il: ערוך את סטטוס של קמפיין

source: Update Campaign's status
he_il: עדכן את סטטוס הקמפיין

source: Add New Campaign's statuses
he_il: הוסף סטטוס קמפיין חדש

source: New Campaign's statuses
he_il: סטטוס קמפיין חדש

source: Campaign's statuses
he_il: סטטוס קמפיין

source: Email Address
he_il: כתובת אימייל

source: Phone Number
he_il: מספר טלפון

source: Last Message
he_il: הודעה אחרונה

source: Photo
he_il: תמונה

source: WPex newsletter campaigns setting page!
he_il: דף הגדרת קמפיינים של הידיעון WPex!

source: Mailchimp API settings
he_il: הגדרות API של Mailchimp

source: An error happened on the WordPress side. Make sure your server allows remote calls.
he_il: התרחשה שגיאה בצד וורדפרס. ודא שהשרת שלך מאפשר קריאות מרוחקות.

source: Save
he_il: שמור

source: No %s
he_il: אין %s

source: Create awesome newsletter with your data in your site and send to third party providers to spread the news.
he_il: צור ניוזלטר מדהים עם התוכן שלך ישירות מהאתר שלך ושלח לספקי צד שלישי כדי להפיץ את החדשות.

source: WPex - Gilad Takoni & Ronen abutbule
he_il: Wpex - גלעד טקוני ורונן אבוטבול
